'''GIT = это система контроля версий (записывает изменения файла или набора файлов в течение времени ).Предназначен для отслеживания ведения истории изменений файлов в проекте.Благодаря GIT мы можем вернуть старую версию проекта !  '''

'''GITHUB = Это сайт или онлайн сервис,предлогает услуги по хранению репозиториев и управления доступом'''



'''
'COMMANDS'
 #git init = иницализация нашего обьекта и создания папки .git(в ней содержится все необходимые файлы нешего репозитория)




#git add (./<file name>) - добовляет файлы с рабочей дiректории в промжуточное пространство = индекс специальное промежуточное пространство, в котором хранятся изменения файлов на пути от рабочей папки до репозитория




#git commit - добавляет все файлы которые находятся в индексе  во внутреннюю базу данных и при этом сохраняет их состояние на данный момент!




#git remote add origin url(https/ssh) = добавляет удаленный репозиторий который находится на каком-нибудь сервере




#git push -u origin 'master ' - отарпавка кода в удаленный репозиторий 




# git branch = показывет список веток 
{#git branch <branch name> - создает ветку с названием ветки <branch name>}



# git checkout <branch name> - переключает на ветку <branch name>




#git pull origin <branch name> - стягиваем изменения с  ветки <branch name> к себе на локалку




#git status - показывает статус проекта




#git log  - журнал коммит




#git clon url(ssh) = копирует чужой проект,(скачивает) чужой проект к себе на локальный проект





'''